src/testing/performance-test/32gb/siege/java/siege-100-users-cse14.txt
kraghupathi:~$ siege -c 100 -r 1 -t 5M http://cse14-iiith.vlabs.ac.in/final-build/EXP_1sep2010/exp1/exp1.html
[alert] Zip encoding disabled; siege requires zlib support to enable it
[error] CONFIG conflict: selected time and repetition based testing
defaulting to time-based testing: 300 seconds
** SIEGE 4.0.2
** Preparing 100 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		      107534 hits
Availability:		      100.00 %
Elapsed time:		      299.07 secs
Data transferred:	       60.20 MB
Response time:		        0.03 secs
Transaction rate:	      359.56 trans/sec
Throughput:		        0.20 MB/sec
Concurrency:		       10.12
Successful transactions:      107534
Failed transactions:	           0
Longest transaction:	        5.06
Shortest transaction:	        0.00
 
Segmentation fault